class Translation(object):
    START_TEXT = """ʜᴇʟʟᴏ, {} ♡

Tʜɪꜱ ɪꜱ ꜰɪʟᴇ ʀᴇɴᴀᴍᴇ ʙᴏᴛ ᴡɪᴛʜ ꜰɪʟᴇ ᴄᴏɴᴠᴇʀᴛᴇʀ

Pʀᴇꜱꜱ ʜᴇʟᴘ ʙᴜᴛᴛᴏɴ ꜰᴏʀ ᴍᴏʀᴇ ɪɴꜰᴏ...  

Pᴏᴡᴇʀᴇᴅ ʙʏ : [ᴅɪsɴᴇʏ ʙᴏᴛs](https://t.me/Disney_Bots)"""

    RENAME_403_ERR = "എന്തുവാടെ കാണിക്കുന്നേ? നിന്നെ ഞാൻ ban ചെയ്തിരിക്കുന്നു. \n\n<b>"
    ABS_TEXT = "നീ എന്തോ ചെയ്യാൻ നോക്കുവാടെ? \n\n<b>"
    UPGRADE_TEXT = "Contact: <b>@KL_noob</b>"
    DOWNLOAD_START = "ഞാൻ Download Start ചെയ്തിട്ടുണ്ട്. എനിക്ക് കുറച്ചു സമയം വേണം. \n\n<b>"
    UPLOAD_START = "ഹോ.. സമാധാനം Download ചെയ്ത് കഴിഞ്ഞു ഇനി Upload ചെയ്യണം. \n\n<b>"
    RCHD_TG_API_LIMIT = "നീ കണ്ടോ ഞാൻ {} സെക്കന്റിൽ Download ചെയ്തു.\nFile Size ഞാൻ കണ്ടുപിടിച്ചു: {}\nSorry നീ എന്തുവാ വിചാരിച്ചേ! ഞാൻ ഇപ്പോൾ Upload ചെയ്യും? \n\n<b>"
    AFTER_SUCCESSFUL_UPLOAD_MSG = "**Rename ചെയ്യാൻ എന്നെ ഉപയോഗിച്ചതിന് നന്ദി അളിയാ, നന്ദി >**"
    AFTER_SUCCESSFUL_UPLOAD_MSG_WITH_TS = "നീ കണ്ടോ ഞാൻ {} സെക്കന്റിൽ Download ചെയ്തു.\nഎന്നിട്ട് {} സെക്കന്റിൽ Upload ചെയ്തു. \n\n<b>"
    NOT_AUTH_USER_TEXT = "Contact: <b>@KL_noob</b>"
    NOT_AUTH_USER_TEXT_FILE_SIZE = "ഈ മെസ്സേജ് നിനക്ക് കിട്ടിയെങ്കിൽ നീ <b>@KL_noob</b> മുതലാളിയെ Contact ചെയ്യണം."
    REPLY_TO_DOC_FOR_RENAME_FILE = "ഒരു ഫയലിനു Reply ആയി <code>/rename</code> <b>NewName.ext</b> എന്ന് തരുക അപ്പോൾ ഞാൻ ആ File Rename ചെയ്തു തരുന്നതാണ്. \n\n<b>"
    SAVED_CUSTOM_THUMB_NAIL = "ഞാൻ Custom Thumbnail Save ചെയ്തു ✅. ഈ Thumbnail ആയിരിക്കും ഇനി മുതൽ ഉള്ള എല്ലാ ഫയലുകൾക്കും ഞാൻ Use ചെയ്യുക. \n\n<b>"
    DEL_ETED_CUSTOM_THUMB_NAIL = "ഞാൻ Custom Thumbnail Delete ചെയ്തു ❎️. ഇനി Thumbnail താരത്തെ അയക്കുന്ന ഫയലുകൾക്ക് Thumbnail കാണില്ല. \n\n<b>"
    FF_MPEG_DEL_ETED_CUSTOM_MEDIA = "Media ഞാൻ മൊത്തത്തിൽ അങ്ങ് കളഞ്ഞു."
    SAVED_RECVD_DOC_FILE = "ഞാൻ File Download ചെയ്തു കഴിഞ്ഞു🤓"
    CUSTOM_CAPTION_UL_FILE = "<i><b>{}</b></i> \n<i><b> ✧━</b></i> \n<i><b>…</b></i> \n<i><b>━✧ </b></i> \n\n<i><b>ѕυρρσят🎗</b></i>"
    NO_CUSTOM_THUMB_NAIL_FOUND = "നീ എനിക്ക് Custom Thumbnail ഒന്നും തന്നില്ല. കഷ്ടം"
    SHOW_CUSTOM_THUMB_NAIL = "<b>🔰Permanent Thumbnail🔰</b> \n\n<b>"
    USER_ADDED_TO_DB = "User <a href='tg://user?id={}'>{}</a> added to {} till {}."
    KL35_THUMBNAIL_PHOTO = "https://telegra.ph/file/1ee9fd2c4b6a6b3c39262.jpg"
    ABOUT_ME = """**Mʏ ɴᴀᴍᴇ :** [Rᴇɴᴀᴍᴇ ᴘʀᴏ ʙᴏᴛ](http://t.me/RenamerXProRobot)

**Cʜᴀɴɴᴇʟ :** [ᴅɪsɴᴇʏ ʙᴏᴛꜱ](https://t.me/Disney_Bots)

**Vᴇʀꜱɪᴏɴ :** [1.0 ʙᴇᴛᴀ](http://t.me/RenamerXProRobot)

**Sᴏᴜʀᴄᴇ :** [Cʟɪᴄᴋ Hᴇʀᴇ](https://t.me/tamilanbots)

**Dᴀᴛᴀʙᴀꜱᴇ :** [Mᴏɴɢᴏᴅʙ](https://www.mongodb.com/)

**Sᴇʀᴠᴇʀ :** [Hᴇʀᴏᴋᴜ](https://heroku.com/)

**Lᴀɴɢᴜᴀɢᴇ :** [Pʏᴛʜᴏɴ 3.9.5](https://www.python.org/)

**Fʀᴀᴍᴇᴡᴏʀᴋ :** [Pʏʀᴏɢʀᴀᴍ 1.4.7](https://docs.pyrogram.org/)

**Dᴇᴠᴇʟᴏᴘᴇʀ :** [𝙼𝚘𝚗𝚎𝚢𝙴𝚊𝚛𝚗𝚅𝙸𝙿](https://t.me/tamilanxbots)

**Pᴏᴡᴇʀᴇᴅ ʙʏ :** [@ᴅɪsɴᴇʏʜᴅʟɪɴᴋs](https://t.me/DisneyHDLinks)
"""
    HELP_USER = """<b> Rᴇɴᴀᴍᴇ </b>

➠ sᴇɴᴅ ᴀ ғɪʟᴇ ᴏʀ ᴍᴇᴅɪᴀ ᴛᴏ ʀᴇᴘʟʏ /rename ғɪʟᴇ ɴᴀᴍᴇ.ᴇxᴛᴇɴsɪᴏɴ

➠ ᴍᴜsᴛ ʀᴇᴘʟʏ ғɪʟᴇ ɴᴀᴍᴇ ᴀɴᴅ ᴇxᴛᴇɴsɪᴏɴ.

<b> ᴄᴏɴᴠᴇʀᴛ ᴠɪᴅᴇᴏ </b>

➠ sᴇɴᴅ ғɪʟᴇ ᴛᴏ ʀᴇᴘʟʏ /convert ɪᴛ ᴄᴏɴᴠᴇʀᴛ ᴀ ᴠɪᴅᴇᴏ ғᴏʀᴍᴀᴛ

<b> sᴇᴛ ᴛʜᴜᴍʙɴᴀɪʟ </b>

➠ sᴇɴᴅ ᴀ ᴘʜᴏᴛᴏ ᴛᴏ ᴍᴀᴋᴇ ɪᴛ ᴀs ᴘᴇʀᴍᴀɴᴇɴᴛ ᴛʜᴜᴍʙɴᴀɪʟ.

<b> ᴅᴇʟᴇᴛɪɴɢ ᴛʜᴜᴍʙɴᴀɪʟ </b>

➠ sᴇɴᴅ /delthumb ᴛᴏ ᴅᴇʟᴇᴛᴇ ᴛʜᴜᴍʙɴᴀɪʟ.

<b> sʜᴏᴡ ᴛʜᴜᴍʙɴᴀɪʟ </b>

➠ sᴇɴᴅ /showthumb ᴛᴏ ᴠɪᴇᴡ ᴄᴜsᴛᴏᴍ ᴛʜᴜᴍʙɴᴀɪʟ.

ᴘᴏᴡᴇʀᴇᴅ ʙʏ : [ᴅɪsɴᴇʏ ʙᴏᴛs](https://t.me/Disney_Bots)"""

